Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetHandler Class
 The CurvedDimensionSetHandler class contains operations for creating curved dimension sets.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.CurvedDimensionSetHandler
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedDimensionSetHandler
<SerializableAttribute>
Public NotInheritable Class CurvedDimensionSetHandler
The CurvedDimensionSetHandler type exposes the following members.
Constructors
Name | Description
CurvedDimensionSetHandler
Initializes a new instance of the CurvedDimensionSetHandler class
Top
Methods
Name | Description
CreateCurvedDimensionSetOrthogonal(ViewBase, Point, Point, Point, PointList, Double)
 Creates a curved dimension set with orthogonal reference lines from the specified points and inserts it to the database.
CreateCurvedDimensionSetOrthogonal(ViewBase, Point, Point, Point, PointList, Double, CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes)
 Creates a curved dimension set with orthogonal reference lines from the specified points and inserts it to the database.
CreateCurvedDimensionSetRadial(ViewBase, Point, Point, Point, PointList, Double)
 Creates a curved dimension set from the specified points and inserts it to the database. Uses the default attributes.
CreateCurvedDimensionSetRadial(ViewBase, Point, Point, Point, PointList, Double, CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes)
 Creates a curved dimension set from the specified points and inserts it to the database.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace